<?php
// Text
$_['text_title']		 = 'پرداخت آنلاین زرین پال';
$_['text_wait']  		 = 'لطفا صبر نمایید!';
$_['text_connect'] 		 = 'در حال اتصال به درگاه زرین پال!';
$_['text_results']  	 = 'رسید زرین پال : ';
$_['text_order_no']  	 = 'خرید شماره: ';

$_['button_view_cart']	 = 'مشاهده سبد خرید';
$_['button_complete']    = 'تکمیل پرداخت';

$_['error_order_id']	 = 'شماره سفارش پیدا نشد !';
$_['error_verify'] = 'اعتبارسنجی تراکنش ناموفق بود';
$_['error_cant_connect']	 = 'مشکلی در اتصال به درگاه زرین پال پیش آمده است!<br>'.
								'لطفا مجددا امتحان کنید.<br>'.
								'در صورت رفع نشدن مشکل به پشتیبانی زرین پال اطلاع دهید.';
$_['error_connect_verify'] = 'مشکلی در اعتبارسنجی پرداخت پیش آمد!<br>'.
								'لطفا مجددا امتحان کنید.<br>'.
								'در صورت رفع نشدن مشکل به پشتیبانی زرین پال اطلاع دهید.';
$_['error_status_-1'] = "اطلاعات ارسالی ناقص می باشند";
$_['error_status_-2'] = "IP و یا مرچنت کد پذیرنده صحیح نمی باشد";
$_['error_status_-3'] = "با توجه به محدودیت های شاپرک امکان پرداخت با رقم درخواست شده میسر نمی باشد";
$_['error_status_-4'] = "سطح تایید پذیرنده پایین تر از سطح نقره ای است";
$_['error_status_-11'] = "درخواست مورد نظر یافت نشد";
$_['error_status_-12'] = "امکان ویرایش درخواست میسر نمی باشد";
$_['error_status_-21'] = "هیچ نوع عملیات مالی برای این تراکنش یافت نشد";
$_['error_status_-22'] = "تراکنش ناموفق می باشد";
$_['error_status_-33'] = "رقم تراکنش با رقم پرداخت مطابقت ندارد";
$_['error_status_-34'] = "تعداد یا رقم از سقف تقسیم تراکنش عبور نموده است";
$_['error_status_-40'] = "اجازه دسترسی به متد مربوطه وجود ندارد";
$_['error_status_-41'] = "اطلاعات اختیاری ارسال شده معتبر نمی باشد";
$_['error_status_-42'] = "مدت زمان معتبر طول عمر شناسه پرداخت باید بین ۳۰ دقیقه تا ۴۵ روز می باشد";
$_['error_status_-54'] = "درخواست مورد نظر آرشیو شده است";
$_['error_status_101'] = "عملیات پرداخت موفق بوده است و قبلا اعتبارسنجی انجام شده است";
$_['error_status_undefined'] = "خطای نامشخص";
?>
